# Лабораторна робота №2
# Виконав студент гр. ІО-71 Морозов-Леонов О.С.
# Варіант 16

P1 = 0.75
P2 = 0.10
P3 = 0.87
P4 = 0.55
P5 = 0.60
P6 = 0.28
P7 = 0.36
P8 = 0.76

# Трикутник 123 - у зірку
P12 = 1 - (1 - P1)*(1 - P2)
P13 = 1 - (1 - P1)*(1 - P3)
P23 = 1 - (1 - P2)*(1 - P3)

# Об'єднання послідовних P13 та P4, P23 та P5
P134 = P13 * P4
P235 = P23 * P5

# Трикутник 678 - у зірку
P67 = 1 - (1 - P6)*(1 - P7)
P68 = 1 - (1 - P6)*(1 - P7)
P78 = 1 - (1 - P7)*(1 - P8)

# Об'єднання послідовних P134 та P67, P235 та P68
P13467 = P134 * P67
P23568 = P235 * P68

# Об'єднання паралельних P13467 та P23568
P_paral = 1 - (1 - P13467)*(1 - P23568)

# Сумарне P - об'єднання послідовних P12, P_paral та P78
P = P12 * P_paral * P78

print("Результуюча ймовірніть безвідмовної роботи:", P)